building-this-site.org
#+TITLE: Building This Site
#+DESCRIPTION: How I built this site.
#+AUTHOR: Russel Arbore
#+LANGUAGE: en

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+OPTIONS: toc:nil timestamp:nil

I found an interesting way to build websites very recently that prompted me to build this site. I've never liked working with html and css, so the sensible option for me to build a website is some sort of translation layer. Coincidentally, I've been using Doom Emacs for a month or two now. One of Emacs' features is *Org Mode*, which allows you to easily write up nicely formatted documents. Conveniently, there are several methods of converting Org documents into html documents. I've chosen to use the =ox-twbs= package to do this conversion. For actually deploying the website into "production", I followed this excellent tutorial: [[https://www.youtube.com/watch?v=3dIVesHEAzc]]. If you want to follow the development of this website, you can see all the website components at [[https://github.com/RArbore/russel-website]].
