html/building-this-site.html
<!doctype html>
<html lang="en">
<head>
<title>Building This Site</title>
<!-- 2021-06-07 Mon 23:34 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Russel Arbore">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"></div><div class="col-md-9 col-md-pull-3"><h1 class="title">Building This Site</h1>
<p>
I found an interesting way to build websites very recently that prompted me to build this site. I&rsquo;ve never liked working with html and css, so the sensible option for me to build a website is some sort of translation layer. Coincidentally, I&rsquo;ve been using Doom Emacs for a month or two now. One of Emacs&rsquo; features is <b>Org Mode</b>, which allows you to easily write up nicely formatted documents. Conveniently, there are several methods of converting Org documents into html documents. I&rsquo;ve chosen to use the <code>ox-twbs</code> package to do this conversion. For actually deploying the website into &ldquo;production&rdquo;, I followed this excellent tutorial: <a href="https://www.youtube.com/watch?v=3dIVesHEAzc">https://www.youtube.com/watch?v=3dIVesHEAzc</a>. If you want to follow the development of this website, you can see all the website components at <a href="https://www.youtube.com/watch?v=3dIVesHEAzc">https://www.youtube.com/watch?v=3dIVesHEAzc</a>. 
</p>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Russel Arbore</p>
<p class="date">Created: 2021-06-07 Mon 23:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="http://orgmode.org">Org-mode</a> 9.5)</p>
</div>
</footer>
</body>
</html>
